# Langkah 0 - Import Library

In [2]:
# melakukan import pada library yang akan dibutuhkan(pandas, labelEncoder dan standardScaler)

import pandas as pd
from sklearn.preprocessing import LabelEncoder, StandardScaler

# Langkah 1 - Load Data

In [4]:
# mendefinisikan path directory dari data set yang akan digunakan
dpath = 'Titanic-Dataset-fixed.csv'
# mengonversikan file data set menjadi variable
df = pd.read_csv(dpath)
# menampilkan 5 baris pertama dari data set
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,DECK,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,DECK,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,DECK,S

# Langkah 2 - Slice Data

In [5]:
# melakukan proses ekstraksi fitur, yaitu pengurangan fitur-fitur yang tersedia hingga tersisa fitur yang relevan saja
# pada kode ini, variable data set dikurangi kolomnya hingga hanya tersisa 'Survived', 'Pclass', 'Age', 'Sex', 'Cabin'
df = df[['Survived', 'Pclass', 'Age', 'Sex', 'Cabin']]
# menampilkan 5 data teratas dari data set
df.head()

   Survived  Pclass   Age     Sex Cabin
0         0       3  22.0    male  DECK
1         1       1  38.0  female   C85
2         1       3  26.0  female  DECK
3         1       1  35.0  female  C123
4         0       3  35.0    male  DECK

In [14]:
# melakukan import pada library dataframe_image
import dataframe_image as dfi
# menggunakan library dfi untuk mengekspor output .head() menjadi gambar
dfi.export(df.head(), 'slice_feature.png')

ModuleNotFoundError: No module named 'dataframe_image'

# Langkah 3 - Encoding
Encoding pada "Sex" dan "Cabin"

In [16]:
le = LabelEncoder() # melakukan instansiasi objek dari class LabelEncoder yang akan melakukan encoding pada data non numerik menjadi data numerik
df['Sex'] = le.fit_transform(df['Sex']) # melakukan encoding pada kolom 'Sex'
df['Cabin'] = le.fit_transform(df['Cabin']) # melakukan encoding pada kolom 'Cabin'

# Langkah 4 - Verifikasi Hasil

In [17]:
df.head() # menampilkan 4 data teratas dari data set

   Survived  Pclass   Age  Sex  Cabin
0         0       3  22.0    1    115
1         1       1  38.0    0     81
2         1       3  26.0    0    115
3         1       1  35.0    0     55
4         0       3  35.0    1    115

# Langkah 5 - Standarisasi

In [19]:
std = StandardScaler() # melakukan instansiasi dari class StandardScaler yang akan digunakan untuk melakukan standarisasi data
df['Age'] = std.fit_transform(df[['Age']]) # proses standarisasi pada kolom 'Age'

# Langkah 6 - Verifikasi Hasil Standarisasi

In [20]:
df.head() # menampilkan 5 data teratas

   Survived  Pclass       Age  Sex  Cabin
0         0       3 -0.592481    1    115
1         1       1  0.638789    0     81
2         1       3 -0.284663    0    115
3         1       1  0.407926    0     55
4         0       3  0.407926    1    115